# Для одной кучи

## 19

```python
from functools import lru_cache

win = 25
sl = 24


def moves(h):
    return h + 2, h * 2


def f(h):
    if h >= win:
        return "W"
    if any(f(x) == "W" for x in moves(h)):
        return "P1"
    # Ваня выигрывает первым ходом при неудачном ходе Пети - any, при любой игре Пети - all
    if any(f(x) == "P1" for x in moves(h)):
        return "B1"
    if any(f(x) == "B1" for x in moves(h)):
        return "P2"
    if all(f(x) == "P1" or f(x) == "P2" for x in moves(h)):
        return "B2"


for i in range(1, sl + 1):
    if f(i) is not None:
        print(i, f(i))
```

## 20, 21

```python
from functools import lru_cache

win = 25
sl = 24


def moves(h):
    return h + 2, h * 2


def f(h):
    if h >= win:
        return "W"
    if any(f(x) == "W" for x in moves(h)):
        return "P1"
    if all(f(x) == "P1" for x in moves(h)):
        return "B1"
    if any(f(x) == "B1" for x in moves(h)):
        return "P2"
    if all(f(x) == "P1" or f(x) == "P2" for x in moves(h)):
        return "B2"


for i in range(1, sl + 1):
    if f(i) is not None:
        print(i, f(i))
```

# Для двух куч

## 19

> Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Назовите минимальное значение S,
> при котором это возможно.

```python
# 19

from functools import lru_cache

win = 75
h1 = 9
sl = 63


def moves(h):
    a, b = h
    return (a + 3, b), (a, b + 3), (a * 2, b), (a, b * 2)


@lru_cache(None)
def f(h):
    if sum(h) >= win:
        return "W"
    if any(f(x) == "W" for x in moves(h)):
        return "P1"
    if any(f(x) == "P1" for x in moves(h)):
        return "B1"
    if any(f(x) == "B1" for x in moves(h)):
        return "P2"
    if all(f(x) == "P1" or f(x) == "P2" for x in moves(h)):
        return "B2"


for s in range(1, sl + 1):
    if f((h1, s)) is not None:
        print(s, f((h1, s)))
```

> Сколько существует значений S, при которых Ваня выигрывает первым ходом?

```python
# any all any all
for i in range(1, sl + 1):
    if f(i) is not None:
        if f(i) == "B1":
            cnt += 1
```

## 20, 21

> №20 Найдите два таких значения S, при которых у Пети есть выигрышная стратегия, причём одно-временно выполняются два
> условия:
> 1) Петя не может выиграть за один ход;
> 2) Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.

> №21 Найдите значение S, при котором одновременно выполняются два условия:
> 1) У Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети
> 2) У Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.

```python
# 20, 21

from functools import lru_cache

win = 41
h1 = 9
sl = 31


def moves(h):
    a, b = h
    return (a + 1, b), (a, b + 1), (a * 2, b), (a, b * 2)


@lru_cache(None)
def f(h):
    if sum(h) >= win:
        return "W"
    if any(f(x) == "W" for x in moves(h)):
        return "P1"
    if all(f(x) == "P1" for x in moves(h)):
        return "B1"
    if any(f(x) == "B1" for x in moves(h)):
        return "P2"
    if all(f(x) == "P1" or f(x) == "P2" for x in moves(h)):
        return "B2"


for s in range(1, sl + 1):
    if f((h1, s)) is not None:
        print(s, f((h1, s)))
```

> Сколько существует значений S, при которых Петя может выиграть своим вторым хо-дом?

```python
# any all any all
for i in range(1, sl + 1):
    if f(i) is not None:
        if f(i) == "P1":
            cnt += 1
```
