# Задание 8

+ Каждую букву использовать 1 раз => permutation
+ Произвольное количество раз => product
+ Обыкновенные комбинации, уникальные => combinations

> Важные моменты:
> 1. permutations не учитывает одинаковые буквы. Чтобы это исправить, нужно использовать set.

## Правило произведения

+ Пусть объект $a$ можно выбрать $m$ способами, после чего объект $b$ можно выбрать $n$ способами. Тогда упорядоченную
  пару $(a, b)$ можно выбрать $mn$ способами

```python
from itertools import *

cnt = 0
# repeat - количество букв в составляемом слове
for x in product('СЛОВО', repeat=4):
    s = ''.join(x)
    # если первая буква согласная и последняя гласная
    if s[0] in 'СЛВ' and s[-1] in 'О':
        cnt += 1

print(cnt)
```

## Размещения

+ Пусть имеется множество, содержащее n элементов. Произвольный упорядоченный набор, составленный из k различных
  элементов данного множества, называется размещением из n элементов по k элементов (или просто размещением из n по k).

### Пример задачи

> Вася составляет 6-буквенные слова, в которых есть только буквы К, А, Н, Т, причём буква К используется в каждом слове
> ровно 2 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться
> совсем.
> Словом считается любая допустимая последовательность букв, необязательно осмысленная. Сколько существует таких слов,
> которые может написать Вася?

### Решение

+ Аналитическое

> Посчитаем количество способов поставить букву К: (6 * 5) / 2! = 15. На остальные 4 позиции мы можем поставить
> оставшиеся
> буквы 3^4 способами. Итоговое количество слов получается: 3^4 * 15 = 1215

+ Программное

```python
from itertools import *

cnt = 0
for x in product('КАНТ', repeat=6):
    s = ''.join(x)
    if s.count('К') == 2:
        cnt += 1
print(cnt)
```

## Подслучаи

### Пример задачи

> Вася составляет 4-буквенные слова, в которых есть только буквы Л, Е, Т, О, причём буква Е используется в каждом слове
> хотя бы 1 раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться
> совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует
> таких
> слов, которые может написать Вася?

### Решение

+ Аналитическое (от противного):

> Посчитаем общее количество слов и вычтем количество слов без Е: всего = 256, без Е = 3^4 = 81.
> Итого: 256 - 81 = 175 слов.

+ Программное:

```python
from itertools import *

word = 'ЛЕТО'
cnt = 0
for x in product(word, repeat=4):
    s = ''.join(x)
    if s.count('Е') >= 1:
        cnt += 1

print(cnt)  # cnt = 175
```

### Пример задачи 2

> Ученица составляет 5-буквенные слова из букв ГЕПАРД. При этом в каждом слове ровно одна буква Г, слово не может
> начинаться на букву А и заканчиваться буквой Е. Какое количество слов может составить ученица?
> Итого: 2200 слов

### Решение задачи 2

+ Аналитическое

+ Программное

```python
from itertools import *

word = 'ГЕПАРД'
cnt = 0
for x in product(word, repeat=5):
    s = ''.join(x)
    if s.count('Г') == 1 and s[0] != 'А' and s[-1] != 'Е':
        cnt += 1
print(cnt)
```

## Перестановки

+ Пусть имеется множество, содержащее n элементов. Произвольная цепочка
  длины n, составленная из всех элементов данного множества, называется перестановкой этого
  множества (или перестановкой n элементов).
  Иными словами, перестановка n элементов — это размещение из n по n.э

+ Формула: $P_n = n!$

+ Формула включений-исключений: комбинаторная формула, позволяющая определить мощность объединения конечного числа
  конечных множеств, которые в общем случае могут пересекаться друг с другом.

### Пример задачи

> Петя составляет 7-буквенные слова перестановкой букв слова АССАСИН. Сколько всего различных слов может составить
> Петя?

### Решение

```python
from itertools import permutations as pm

cnt = 0
for x in set(pm('АССАСИН')):
    cnt += 1
print(cnt)
```

### Пример задачи 2

> Вася составляет 5-буквенные коды из букв К, А, Л, И, Й. Каждую букву нужно использовать ровно 1 раз, при этом код не
> может начинаться с буквы Й и не может содержать сочетания ИА. Сколько различных кодов может составить Вася?

### Решение задачи 2

+ Аналитическое (Формула включений-исключений)

> Всего слов - слова, начинающиеся на Й - слова, содержащие ИА + слова, начинающиеся на Й и содержащие ИА =
> 5! - 4! - 4! + 3! = 120 - 24 - 24 + 6 = 78

+ Программное

```python
from itertools import permutations as pm

cnt = 0
for x in pm('КАЛИЙ'):
    s = ''.join(x)
    if s[0] != 'Й' and 'ИА' not in s:
        cnt += 1
print(cnt)
```

### Пример задачи 3

> Петя составляет 5-буквенные слова из букв К, О, Л, У, Н. Каждую букву нужно использовать ровно 1 раз, при этом код при
> этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Петя?

### Решение задачи 3

```python
from itertools import permutations as pm

cnt = 0
w = ['ОУ', 'УО', 'КЛ', 'ЛК', 'КН', 'НК', 'ЛН', 'НЛ']
for x in pm('КОЛУН'):
    s = ''.join(x)
    if all(sub not in s for sub in w):
        cnt += 1
print(cnt)
```

### Пример задачи 4

> Маша составляет 7-буквенные коды из букв П, Е, С, К, А, Р, Ь. Каждую букву нужно использовать ровно 1 раз, при этом
> код буква Ь не может стоять на первом месте, а также перед буквами Е, А и Р. Сколько различных кодов может составить
> Маша?

### Решение задачи 4

```python
from itertools import permutations as pm

cnt = 0
for x in pm('ПЕСКАРЬ'):
    s = ''.join(x)
    if s[0] != 'Ь' and all(sub not in s for sub in ['ЬЕ', 'ЬА', 'ЬР']):
        cnt += 1
print(cnt)
```
